In [30]:
from IPython.core.interactiveshell import InteractiveShell #print Multiple variables
InteractiveShell.ast_node_interactivity='all'

In [31]:
import pandas as pd

Creating data

In [32]:
t1 = pd.DataFrame([[310, 123]], columns = ['A', 'B'])
#  or equivalent
t2 = pd.DataFrame({'A': [310], 'B':[123]})

t1
t2

     A    B
0  310  123

     A    B
0  310  123

In [33]:
t1 = pd.DataFrame([[35, 21], [41, 34]], columns=['Apples', 'Bananas'], 
                           index=['2017 Sales', '2018 Sales'])
#  or equivalent
t2 = pd.DataFrame({'Apples':[35, 41], 'Bananas':[21, 34]}, index=['2017 Sales', '2018 Sales'])

t1
t2

            Apples  Bananas
2017 Sales      35       21
2018 Sales      41       34

            Apples  Bananas
2017 Sales      35       21
2018 Sales      41       34

In [34]:
quantites = ['4 cups', '1 cup', '2 large', '1 can']
item = ['Flour', 'Milk', 'Eggs', 'Spam']
ingredients = pd.Series(quantites, index = item, name='Dinner')
ingredients

Flour     4 cups
Milk       1 cup
Eggs     2 large
Spam       1 can
Name: Dinner, dtype: object

df.shape: check how large the resulting DataFrame

df.head(): which grabs the first five rows.

In [35]:
t2.shape
t2.head()

(2, 2)

            Apples  Bananas
2017 Sales      35       21
2018 Sales      41       34